import { MessageItem } from "@/types";

export const themes = {
  THEME_DARK: "dark",
  THEME_LIGHT: "light",
};

export const themesList = [
  {
    value: "light",
    label: "روشن",
    icon: "/assets/icons/sun.svg",
  },
  {
    value: "dark",
    label: "تاریک",
    icon: "/assets/icons/moon.svg",
  }
];

export const drawerLength="266";


export const messageList: MessageItem[] = [
  {
    id: "1",
    owner: "من",
    message: "اولین پیام وام بگیرم؟",
  },
  {
    id: "2",
    owner: "سیستم",
    message: "اجرا قسط یک ماه را ندهیم و ماه بعد دوتا قسط را بدهیم مشکلی پیش میاد میشه جواب بدین",
  },
  {
    id: "3",
    owner: "سیستم",
    message: "بدون‌اینکه من درخبر باشم برای من حساب باز کردن وام گرفتن و تقربیا سه ماه پیش از حسابم برداشت \
    بعداز تحقیق فهمیدم که سه فقره وام 50 میلیون تومانی گرفته\
    بعداز این که فهمیدم بازرسی کرمان درمیان گذاشتم وچند روز پیش که خبر گرفتم به من گفتم تمام مدارک لازم هست که شما بودین وتعهد رو دادین\
    وبازرس گفت چون شما از اون شرکت‌ اومدین بیرون شما دارین شکایت میکنید\
    الان شما به من کمک میکنید که چیکار باید بکنم",
  },
  {
    id: "4",
    owner: "من",
    message: "کسر از حقوق ضامن بابت وام",
  },
  {
    id: "5",
    owner: "من",
    message: "دریافت وام ازدواج در صورت داشتن بدهی بانکی",
  },
  {
    id: "6",
    owner: "سیستم",
    message: "بدون‌اینکه من درخبر باشم برای من حساب باز کردن وام گرفتن و تقربیا سه ماه پیش از حسابم برداشت \
    بعداز تحقیق فهمیدم که سه فقره وام 50 میلیون تومانی گرفته\
    بعداز این که فهمیدم بازرسی کرمان درمیان گذاشتم وچند روز پیش که خبر گرفتم به من گفتم تمام مدارک لازم هست که شما بودین وتعهد رو دادین\
    وبازرس گفت چون شما از اون شرکت‌ اومدین بیرون شما دارین شکایت میکنید\
    الان شما به من کمک میکنید که چیکار باید بکنم",
  },
  {
    id: "7",
    owner: "من",
    message: "کسر از حقوق ضامن بابت وام",
  },
  {
    id: "8",
    owner: "من",
    message: "دریافت وام ازدواج در صورت داشتن بدهی بانکی",
  },
  {
    id: "9",
    owner: "من",
    message: "کسر از حقوق ضامن بابت وام",
  },
  {
    id: "10",
    owner: "من",
    message: "آخرین پیام کاربر",
  },
];


export const historyMessageList: any[] = [
  {
    id: "1",
    title: "دیروز",
    messages: [
      "اولین پیام وام بگیرم؟",
       "دریافت وام ازدواج بانکی",
    ],
  },
  {
    id: "2",
    title: "سه روز پیش",
    messages: [
      "اولین پیام وام بگیرم؟",
       "دریافت وام ازدواج بانکی",
       "کی وام بگیرم؟",
    ],
  },
  {
    id: "3",
    title: "مهرماه",
    messages: [
      "کسر از حقوق ضامن بابت وام",
       "دریافت وام ازدواج بانکی",
       "کسر از حقوق ضامن بابت وام",
       "کی وام بگیرم؟",
    ],
  },
];

export const contextMessageList: any[] = [
  {
    id: "1",
    title:"سوالات متداول",
    messages: [
       {value: 1, label: "اولین پیام وام بگیرم؟"},
       {value: 2, label: "دریافت وام ازدواج بانکی"},
       {value: 3, label: "کی وام بگیرم؟"},
       {value: 4, label: "اجرا قسط یک ماه را ندهیم و ماه بعد دوتا قسط را بدهیم مشکلی پیش میاد میشه جواب بدین"},
       {value: 5, label: "دریافت وام ازدواج بانکی"},
    ],
  },
  {
    id: "2",
    title:"پروفایل های شخصی",
    messages: [
       {value: 1, label: "اولین پیام وام بگیرم؟"},
       {value: 2, label: "دریافت وام ازدواج بانکی"},
       {value: 3, label: "کی وام بگیرم؟"},
       {value: 4, label: "اجرا قسط یک ماه را ندهیم و ماه بعد دوتا قسط را بدهیم مشکلی پیش میاد میشه جواب بدین"},
       {value: 5, label: "دریافت وام ازدواج بانکی"},
    ],
  }
];


